#====================================矩阵====================================
#矩阵生成
(x = matrix(nrow = 2, ncol = 3))
(x = matrix(1:18, nrow = 3, ncol = 6))
(x = matrix(
  1:18,
  nrow = 3,
  ncol = 6 ,
  byrow = T
))

#由向量转换成矩阵
(x = 1:18)
dim(x) = c(3, 6)
x

#由多个向量组合成矩阵
(x = 1:10)
(y = 11:20)
(z = 21:30)
(m1 = rbind(x, y, z))
(m2 = cbind(x, y, z))

#矩阵的读取
(x = matrix(
  1:18,
  nrow = 3,
  ncol = 6,
  byrow = T
))
x[2, 3]
x[2,]
x[, 3]
x[, c(2, 3, 5)]
x[c(1, 2),]
x[c(1, 2), c(2, 3, 4)]

#行列的命名
colnames(x) = c('C1', 'C2', 'C3', 'C4', 'C5', 'C6')
rownames(x) = c('R1', 'R2', 'R3')
x
x['R1', 'C1']
x[c('R2', 'R3'), c('C2', 'C4')]


#矩阵的运算
(m1 = matrix(1:12, nrow = 3, ncol = 4))
(m2 = matrix(13:24, nrow = 3, ncol = 4))
m1
m2
m1 + 10
m1 + m2
m1 * 10
m1 * m2 #R语言定义的乘法：对应元素相乘
m1 %*% t(m2) #数学定义的矩阵乘法

#生成对角阵
diag(4)
diag(c(1, 2, 3, 5))

#提取对角阵
(a = matrix(1:16, 4, 4))
diag(a)

#求逆
(x = matrix(rnorm(16, 10, 2), 4, 4)) #随机生成
(y = solve(x))
x %*% y

#求解线性方程组
(b = 1:4)
solve(x, b)


#====================================数据框====================================
#数据框表示：每一行是一个记录,每一条记录有多个域（列）
#创建data frame
(a = data.frame(
  fx = rnorm(10, 10, 2),
  fy = runif(10, 10, 20),
  fmonth = 1:10
))
#普通访问方式
a[1, 1]
a[1,]
a[, 2]
a[1,'fx']

#访问域(推荐)
(y3 = a$fx)

#访问域（不推荐）
(y2 = a[[1]][2])
(y2 = a[['fx']][2])

#返回当前搜索路径
search()
#将a加入搜索路径
attach(a)
fx
#将a从搜索路径中删除
detach(a)
fx


#只读（好像是覆盖操作）
a = with (a, {
  fx = rnorm(10, 10, 20)
})


#修改(好像是append操作)
a = within(a, {
  fx = 1:10
  abc = 2:11
})
a

#增加一个域方法
a$fz = a$fx + a$fy
a

b = subset(a, fx > 1 & fmonth == 8, select = c(fx, fmonth))
b

#会弹出一个可修改的表格，但并不改变a本身
b = edit(a)
#会弹出一个可修改的表格，并且会改变a的本身
c = fix(a)


#====================================列表====================================
#列表构成：成分 ，多用于返回值（函数）

#列表的创建
(a = list(
  x = 1:10,
  y = matrix(1:16, 4, 4),
  z = data.frame()
))

#别名
names(a) = c('c1', 'c2', 'c3')
a


#访问（不推荐）
c = a['y']
c[2, 1]
class(c)

c = a[['y']]
c[2, 1]
class(c)

#访问（推荐）
a$y[2, 1]



#====================================数组====================================

(a = array(1:60, c(3, 4, 5)))

a[1, 2, 3]


#===================================数据类型转换====================================

x = c(1:2, 'hello', T)
x
mode(x)
class(x)

is.vector(x)
(y = matrix(1:20, c(4, 5)))
mode(y)
class(y)

(dy = as.data.frame(y))
